{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "DATE",
    "1": "IDENTITY",
    "2": "TYPE",
    "3": "PII",
    "4": "FINANCE",
    "5": "STATUS",
    "6": "BLOB",
    "7": "COUNT",
    "8": "DESCRIPTION",
    "9": "FILENAME",
    "10": "CODE ",
    "11": "BOOLEAN",
    "12": "UNDEFINED",
    "13": "MEDIA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "BLOB": 6,
    "BOOLEAN": 11,
    "CODE ": 10,
    "COUNT": 7,
    "DATE": 0,
    "DESCRIPTION": 8,
    "FILENAME": 9,
    "FINANCE": 4,
    "IDENTITY": 1,
    "MEDIA": 13,
    "PII": 3,
    "STATUS": 5,
    "TYPE": 2,
    "UNDEFINED": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
